python/tests/outputs/cycles/expected.mmd
graph TD
    domain_one --> domain_two
    domain_three --> domain_one
    domain_two --> domain_three
    leftover --> domain_one
